insert into themes values
(1,'География мира'),
(2,'История и исторические люди'),
(3,'Спорт'),
(4,'Кино'),
(5,'Музыка'),
(6,'Животные'),
(7, 'Наука'),
(8, 'Игры и головоломки'),
(9, 'Космос и астрономия'),
(10, 'Валюты');



insert into questions values

(1,'Какое самое большое по площади озеро в мире? Оно также именуется морем', 1,'Каспийское',100),
(2,'В какой стране находится самый большой в мире тропический лес?', 1,'Бразилия',100),
(3,'Как называется столица Австралии?', 1,'Канберра',200),
(4,'В каком океане находится Курильские острова?', 1,'Тихий',200),
(5,'Какое самое высокое горное образование в мире?', 1,'Эверест',300),
(6,'Какое государство расположено на южном побережье Африки? Ответ аббревиатура', 1,'ЮАР',300),
(7,'В какой части света находится Гималаи?', 1,'Азия',400),
(8,'В какой стране находится Эльбрус?', 1,'Россия',400),
(9,'В каком океане находится Мадагаскар?', 1,'Индийский',500),
(10,'Как называется самый крупный город в мире по численности населения?', 1,'Токио',500),

(11, 'Кто был первым человеком, побывавшим на Луне (Фамилия)?',2, 'Армстронг',100),
(12, 'Кто был первым президентом США (Фамилия)?',2, 'Вашингтон',100),
(13, 'Кто был основателем теории относительности (Фамилия)?',2, 'Эйнштейн', 200),
(14, 'Как звали основателя марксизма (Имя)?',2, 'Карл',200),
(15, 'Кто был главным героем Российской революции 1917 года (Фамилия)?',2, 'Ленин',300),
(16, 'В каком месте произошла битва, которая завершила Наполеоновские войны в Европе?',2, 'Ватерлоо',300),
(17, 'Кто был создателем теории гравитации (Фамилия)?',2, 'Ньютон',400),
(18, 'Кто был первым известным историческим философом?',2, 'Гераклит',400),
(19, 'Кто был создателем теории эволюции (Фамилия)?',2, 'Дарвин',500),
(20, 'Кто был первым императором России (Имя)?',2, 'Петр',500),

(21, 'Сборная какой страны победила на первом чемпионате мира по футболу в 1930 году?',3, 'Уругвай',100),
(22, 'Какой город был хозяином Летних Олимпийских игр 2008 года?',3, 'Пекин',100),
(23, 'Как называется самый престижный турнир по баскетболу?(Аббревиатура кириллицей)',3, 'НБА',200),
(24, 'Как называется самый престижный турнир по хоккею?(Аббревиатура кириллицей)',3, 'НХЛ',200),
(25, 'В каком виде спорта выступал человек по имени Тайгер Вудс?',3, 'Гольф',300),
(26, 'Как называется игра с мячом, в которой необходимо отбивать мяч битой?',3, 'Бейсбол',300),
(27, 'Фамилия легендарного советского вратаря, обладателя золотого мяча?',3, 'Яшин',400),
(28, 'Сборная какой страны стала чемпионом мира по футболу в 2022 году в Катаре?',3, 'Аргентина',400),
(29, 'В каком виде спорта выступает спортсменка Мария Шарапова? (ответ одним словом)',3, 'Теннис', 500),
(30, 'Фамилия легендарного игрока NBA, игравшего в команде Chicago Bulls под 23 номером?',3, 'Джордан',500),

(31, 'Какой фильм является самым кассовым в истории кино?',4, 'Аватар',100),
(32, 'Какое имя у главного героя сериала "Друзья"?',4, 'Росс',100),
(33, 'Как зовут главного героя в фильме "Титаник"?',4, 'Джек',200),
(34, 'Какое прозвище было у главного персонажа трилогии "Матрица"?',4, 'Нео',200),
(35, 'Фамилия режиссера снявшего фильм "Криминальное чтиво"?',4, 'Тарантино',300),
(36, 'Имя человека, который скрывается под маской человека-паука? (только имя)',4, 'Питер',300),
(37, 'Имя персонажа Тома Хэнкса, который участвовал во Вьетнамской войне, а также 3 года бегал?(только имя)',4, 'Форрест',400),
(38, 'В каком фильме произошло восстание машин, во главе с Арнольдом Шварцнеггером?',4, 'Терминатор',400),
(39, 'В каком фильме снялся Сильвестер Сталоне, и сыграл там боксера?',4, 'Рокки',500),
(40, 'Назовите имя супергероя, также известного как Брюс Уэйн',4, 'Бэтмен',500),

(41, 'Как называется группа у которой есть песня We Will Rock You?(Ответ латинскими буквами)',5, 'Queen',100),
(42, 'Название группы исполняющей песню "Smells Like Teen Spirit"?(Ответ латинскими буквами)',5, 'Nirvana',100),
(43, 'Название группы, которую исполняла песню "Waterloo" на конкурсе "Евровидение" в 1974 году?(Ответ латинскими буквами)',5, 'ABBA',200),
(44, 'Как называется песня группы "The Beatles", которая стала одной из самых известных в мире?(Ответ латинскими буквами)',5, 'Yesterday',200),
(45, 'Имя исполнителя, который снимался в фильме "8-ая миля"?(Ответ латинскими буквами)',5, 'Eminem',300),
(46, 'Какой музыкальный инструмент был изобретен Адольфом Саксом?',5, 'Саксофон',300),
(47, 'Как называется музыкальный инструмент, имеющий три струны и треугольную форму?',5, 'Балалайка',400),
(48, 'Какой музыкальный инструмент извлекает ламповый звук? Но иногда и транзисторный',5, 'Электрогитара',400),
(49, 'Фамилия композитора который написал произведение "Лунная соната"',5, 'Бетховен',500),
(50, 'Фамилия композитора который написал произведение "Лебединое озеро"',5, 'Чайковский',500),


(51, 'Как называется животное, которое имеет самый большой мозг в мире?',6, 'Кит',100),
(52, 'Какой животный рекордсмен умеет бегать со скоростью 100 км/ч?',6, 'Гепард',100),
(53, 'Какое животное является символом Австралии?',6,'Кенгуру',200),
(54, 'Какой зверек является национальным символом России?',6,'Медведь',200),
(55, 'Как называется животное, которое может менять свой цвет?',6,'Хамелеон',300),
(56, 'Как называется животное, которое именуют "кораблем пустыни"?',6,'Верблюд',300),
(57, 'Сколько ножек у паука?(ответ цифрой)',6,'8',400),
(58, 'Как называется морской хищник, который также был показан в фильме "Челюсти"?',6,'Акула',400),
(59, 'Как называется забавная птица, обитающая в Антарктике?',6,'Пингвин',500),
(60, 'Это животное бывает и морским и домашним, любит рыбу. Как называется это животное?',6,'Кот',500),

(61, 'Как называется процесс, при котором растения преобразуют солнечную энергию в химическую энергию, используемую для питания?',7, 'Фотосинтез',100),
(62, 'Как называется элементарная частица, в переводе с греческого означает "неделимый?"',7, 'Атом',100),
(63, 'Как называется фундаментальная сила, являющаяся основой закона всемирного тяготения?',7, 'Гравитация',200),
(64, 'Какая частица несет электрический заряд?',7, 'Электрон',200),
(65, 'Как называется молекула, которая содержит генетическую информацию всех живых организмов?',7, 'ДНК',300),
(66, 'Как называется наука, которая изучает наследственность и изменчивость живых организмов на уровне генов и хромосом',7, 'Генетика',300),
(67, 'Представителям какой науки были такие ученые как Эйнштейн или Хокинг?',7, 'Физика',400),
(68, 'Как называется наука изучающая язык?',7, 'Лингвистика',400),
(69, 'Сколько хромосом у здорового человека?(ответ цифрой)',7, '46',500),
(70, 'Какому физическому явлению свойственно проявлять и как волна и как частица?',7, 'Свет',500),


(71, 'Как называется головоломка, в которой нужно отгадывать слова, написанные по горизонтали и вертикали?', 8, 'Кроссворд',100),
(72, 'Как называется головоломка, в которой нужно заполнить клетки игрового поля цифрами от 1 до 9, так чтобы в каждой горизонтали, вертикали и квадрате 3x3 не было повторений цифр?', 8, 'Судоку',100),
(73, 'Как называется игра, разновидностью который является "Техасский Холдем"', 8, 'Покер',200),
(74, 'Назовите головоломку, суть которой собрать картину из множества кусочков', 8, 'Паззл',200),
(75, 'Как называется настольная игра, где есть король и королева?', 8, 'Шахматы',300),
(76, 'Кто изобрел цветной куб-головоломку?', 8, 'Рубик',300),
(77, 'В какой настольной игре нужно передвигать фишки, после броска двух кубиков?', 8, 'Нарды',400),
(78, 'Сколько клеток в шахматной доске?(Ответ цифрой)', 8, '64',400),
(79, 'В эту игру играл бегемот в мультсериале "Ну-погоди"', 8, 'Городки',500),
(80, 'В какой игре можно "выйти в дамки"?', 8,'Шашки',500),

(81, 'Какая планета является самой близкой к Солнцу?',9, 'Меркурий',100),
(82, 'В каком году произошел первый полет человека в космос?(Ответ цифрой)',9, '1961',100),
(83, 'Сколько планет в Солнечной системе?(Ответ цифрой)',9, '8',200),
(84, 'В честь какого древнегреческого героя была названа программа NASA с целью осуществления первой пилотируемой высадки на Луну?',9, 'Аполлон',200),
(85, 'Какая планета в солнечной системе имеет наибольшее количество спутников?',9, 'Юпитер',300),
(86, 'Как называется группа звезд, которые создают определенную фигуру на ночном небе?',9, 'Созвездие',300),
(87, 'Как называется закольцованная траектория движения небесного тела?',9, 'Орбита',400),
(88, 'И римский бог войны и планета?',9, 'Марс',400),
(89, 'Сколько минут требуется свету излучаемому Солнцем, чтобы достичь поверхности Земли?(Ответ цифрой)',9, '8',500),
(90, 'Самая удаленная от Солнца планета Солнечной системы?(не Плутон)',9, 'Нептун',500),

(91, 'Назовите валюту США?', 10, 'Доллар',100),
(92, 'Назовите валюту Европейского союза?', 10, 'Евро',100),
(93, 'Назовите валюту Китая?', 10, 'Юань',200),
(94, 'Назовите валюту Японии?', 10, 'Иена',200),
(95, 'Назовите валюту Казахстана?', 10, 'Тенге',300),
(96, 'Назовите валюту Азербайджана?', 10, 'Манат',300),
(97, 'Назовите валюту Армении?', 10, 'Драм',400),
(98, 'Назовите валюту Грузии?', 10, 'Лари',400),
(99, 'Назовите валюту Бразилии', 10, 'Реал',600),
(100, 'Назовите валюту Мексики', 10, 'Песо',500);


ALTER SEQUENCE questions_id_seq RESTART WITH 101;
ALTER SEQUENCE themes_id_seq RESTART WITH 11;












